configuration/src/ChartsOfCharacteristicTypes/ВидыДополнительныхРеквизитов/ВидыДополнительныхРеквизитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыДополнительныхРеквизитов</name>
  <type>
    <types>CatalogRef.ДополнительныеОписанияОбъектов</types>
    <types>CatalogRef.Пользователи</types>
    <types>CatalogRef.ВидыЗадач</types>
    <types>Boolean</types>
    <types>CatalogRef.НаправленияРазработки</types>
    <types>DocumentRef.Задача</types>
    <types>String</types>
    <types>CatalogRef.Услуги</types>
    <types>Date</types>
    <types>Number</types>
    <types>CatalogRef.ДоступныеЗначенияРеквизитов</types>
    <types>CatalogRef.СистемыУчета</types>
    <types>CatalogRef.НазначенияЗадач</types>
    <numberQualifiers>
      <precision>12</precision>
      <scale>2</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>500</length>
    </stringQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НастройкиОповещенийУведомлений</name>
      <description>Настройки оповещений уведомлений</description>
      <code>000000061</code>
      </content>
      </content>
    </items>
    <items>
      <name>MarkdownОписаниеЗафиксировано</name>
      <description>Markdown описание зафиксировано</description>
      <code>000000112</code>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>АвтоматическоеИзменениеСтатусаПослеОбновления</name>
      <description>Автоматическое изменение статуса после обновления</description>
      <code>000000019</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>АвтоматическоеНазначениеФилиала</name>
      <description>Автоматическое назначение филиала</description>
      <code>000000091</code>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>ДатаПоследнегоИзмененияОбъекта</name>
      <description>Дата последнего изменения объекта</description>
      <code>000000001</code>
      <type>
        <types>Date</types>
      </type>
    </items>
    <items>
      <name>ДатаПоследнегоИзмененияПодчиненныхОбъектов</name>
      <description>Дата последнего изменения подчиненных объектов</description>
      <code>000000002</code>
      <type>
        <types>Date</types>
      </type>
    </items>
    <items>
      <name>ДатаПоследнейОтправкиОповещенийОЗанесенииТрудозатрат</name>
      <description>Дата последней отправки оповещений о занесении трудозатрат</description>
      <code>000000016</code>
      <type>
        <types>Date</types>
      </type>
    </items>
    <items>
      <name>ЗадачаНаАвтотесты</name>
      <description>Задача на автотесты</description>
      <code>000000006</code>
      <type>
        <types>DocumentRef.Задача</types>
      </type>
    </items>
    <items>
      <name>ЗадачаНаДокументацию</name>
      <description>Задача на документацию</description>
      <code>000000007</code>
      <type>
        <types>DocumentRef.Задача</types>
      </type>
    </items>
    <items>
      <name>ЗапрещеноИзменениеОписанияЗаявки</name>
      <description>Запрещено изменение описания</description>
      <code>000000085</code>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>КоличествоПодчиненныхЗадач</name>
      <description>Количество подчиненных задач</description>
      <code>000000092</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>ОписаниеФорматаHTML</name>
      <description>Описание формата HTML</description>
      <code>000000096</code>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>Куратор</name>
      <description>Ответственный</description>
      <code>000000101</code>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </items>
    <items>
      <name>ПлановоеВремяТестирования</name>
      <description>Плановое время тестирования</description>
      <code>000000003</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>ПлановыеТрудозатраты</name>
      <description>Плановые трудозатраты</description>
      <code>000000087</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>ПримечаниеРазработчиков</name>
      <description>Примечание разработчиков</description>
      <code>000000004</code>
      <type>
        <types>CatalogRef.ДополнительныеОписанияОбъектов</types>
      </type>
    </items>
    <items>
      <name>ПримечаниеТестировщиков</name>
      <description>Примечание тестировщиков</description>
      <code>000000009</code>
      <type>
        <types>CatalogRef.ДополнительныеОписанияОбъектов</types>
      </type>
    </items>
    <items>
      <name>РевьюерОбъекта</name>
      <description>Ревьюер объекта</description>
      <code>000000080</code>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </items>
    <items>
      <name>РезультатПоследнегоТестирования</name>
      <description>Результат последнего тестирования</description>
      <code>000000008</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </items>
    <items>
      <name>СмещениеВремени</name>
      <description>Смещение времени</description>
      <code>000000093</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>СозданЧерезБыстроеСозданиеЗадачи</name>
      <description>Создан через быстрое создание задачи</description>
      <code>000000076</code>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>СозданЧерезГрупповоеВнесениеТрудозатрат</name>
      <description>Создан через групповое внесение трудозатрат</description>
      <code>000000072</code>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>СрокАктуальностиЗаявкиВСтатусеНаДоработку</name>
      <description>Срок актуальности заявки в статусе &quot;На доработку&quot;</description>
      <code>000000059</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>ФактическаяСтоимостьРабот</name>
      <description>Стоимость работ (Общие)</description>
      <code>000000094</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>ФактическиеТрудозатратыЗадачи</name>
      <description>Фактические трудозатраты (Задачи)</description>
      <code>000000089</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>ФактическиеТрудозатратыЗаявки</name>
      <description>Фактические трудозатраты (Заявки)</description>
      <code>000000090</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>ФактическиеТрудозатраты</name>
      <description>Фактические трудозатраты (Общие)</description>
      <code>000000088</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>ЦелеваяЗаявка</name>
      <description>Целевая заявка</description>
      <code>000000107</code>
      <type>
        <types>Boolean</types>
      </type>
    </items>
    <items>
      <name>ЧекЛистТестирования</name>
      <description>Чек лист тестирования</description>
      <code>000000005</code>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <comment>Признак необходимости проверки заполненности значения характеристики</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокСледования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проверяемый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактированиеВИнтерфейсе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактированиеВФормеОбъекта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИспользоватьВОбъектах</name>
    <attributes>
      <name>Тип</name>
      <comment>Хранит пустую ссылку на тот объект, в котором используется этот вид реквизита</comment>
      <type>
        <types>DefinedType.ВладелецДополнительныхРеквизитов</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <comment>Описание типа для администраторов</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Филиал</name>
      <comment>Если пустая ссылка - доступен всем, иначе только указанным филиалам</comment>
      <type>
        <types>CatalogRef.Филиалы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

configuration/src/Documents/ЗаявкаНаРазработку/ЗаявкаНаРазработку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаРазработку</name>
  <basedOn>Catalog.Проекты</basedOn>
  <basedOn>Document.ВнутреннееЗадание</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПроцесса</name>
    <type>
      <types>EnumRef.ВидыПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРодительскогоПроекта</name>
    <type>
      <types>CatalogRef.ВидыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Некоторые заявки находятся в статусе &quot;Черновик&quot;. При отключении этого статуса дата документа меняется на текущую. Чтобы не потерять исходную дату создания заявки, она помещается в этот реквизит</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортированаИзRedmine</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексируемоеОписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСистемРазработки</name>
    <comment>Количество систем разработки для заявки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КороткийНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.НазначенияЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.НаправленияРазработки</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачиRedmine</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектОснование</name>
    <type>
      <types>DocumentRef.ВнутреннееЗадание</types>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграниченныйПросмотр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеСистем</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукт</name>
    <type>
      <types>CatalogRef.Продукты</types>
    </type>
  </attributes>
  <attributes>
    <name>СерьезностьОшибки</name>
    <type>
      <types>CatalogRef.СерьезностьОшибок</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокРеализации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФинальныйСтатус</name>
    <comment>Финальный статус заявки</comment>
    <type>
      <types>CatalogRef.СтатусыОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Черновик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеЛицо</name>
    <type>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СистемыРазработки</name>
    <attributes>
      <name>Система</name>
      <type>
        <types>CatalogRef.СистемыУчета</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаЗаказчиков</name>
      <type>
        <types>CatalogRef.ГруппыЗаказчиковНаправлений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

configuration/src/ChartsOfCharacteristicTypes/ВидыДополнительныхРеквизитов/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Добавляет обработчики обновления
//
// Параметры:
//  Обработчики	 - ТаблицаЗначений	 - см. ПриложениеВызовСервера.ПолучитьОбработчикиДанных
//
Процедура ДобавлениеОбработчиковОбновления(Обработчики) Экспорт     
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "ПланыВидовХарактеристик.ВидыДополнительныхРеквизитов.ПроверитьПредопределенныеЭлементы";
	  
КонецПроцедуры

// Проверяет предопределенные настройки
//
Процедура ПроверитьПредопределенныеЭлементы() Экспорт 
	
	ЗаполнитьПредопределенныйЭлемент("РевьюерОбъекта", Справочники.Пользователи.ПустаяСсылка());
	ЗаполнитьПредопределенныйЭлемент("АвтоматическоеИзменениеСтатусаПослеОбновления", Справочники.СистемыУчета.ПустаяСсылка());	
	
	ЗаполнитьПредопределенныйЭлемент("ПримечаниеТестировщиков", Документы.Задача.ПустаяСсылка());     
	ЗаполнитьПредопределенныйЭлемент("ПримечаниеРазработчиков", Документы.Задача.ПустаяСсылка());     
	ЗаполнитьПредопределенныйЭлемент("ЧекЛистТестирования", Документы.Задача.ПустаяСсылка());     
	ЗаполнитьПредопределенныйЭлемент("РевьюерОбъекта", Документы.Задача.ПустаяСсылка());  
	ЗаполнитьПредопределенныйЭлемент("ЗадачаНаАвтотесты", Документы.Задача.ПустаяСсылка());  	
	
	ЗаполнитьПредопределенныйЭлемент("Куратор", Документы.ЗаявкаНаРазработку.ПустаяСсылка());     
	ЗаполнитьПредопределенныйЭлемент("ЦелеваяЗаявка", Документы.ЗаявкаНаРазработку.ПустаяСсылка());     
	ЗаполнитьПредопределенныйЭлемент("ЗапрещеноИзменениеОписанияЗаявки", Документы.ЗаявкаНаРазработку.ПустаяСсылка());     
	
	// под вопросом, возможно не надо
	ЗаполнитьПредопределенныйЭлемент("ДатаПоследнегоИзмененияОбъекта", Справочники.Проекты.ПустаяСсылка());     
	ЗаполнитьПредопределенныйЭлемент("ДатаПоследнегоИзмененияПодчиненныхОбъектов", Справочники.Проекты.ПустаяСсылка());     
    ЗаполнитьПредопределенныйЭлемент("РезультатПоследнегоТестирования", Документы.Задача.ПустаяСсылка());     
	ЗаполнитьПредопределенныйЭлемент("ЗадачаНаДокументацию", Документы.Задача.ПустаяСсылка());  
	ЗаполнитьПредопределенныйЭлемент("СрокАктуальностиЗаявкиВСтатусеНаДоработку", Справочники.НаправленияРазработки.ПустаяСсылка()); 	
	
КонецПроцедуры     

// Проверяет наличие дополнительных реквизитов для типа объекта с учетом группы пользователя
//
// Параметры:
//  Объект	 - ОпределяемыйТип.ВладелецДополнительныхРеквизитов	 - объект
// 
// Возвращаемое значение:
//   - Булево
//
Функция ДляОбъектаЕстьДополнительныеРеквизиты(Знач Объект) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИСТИНА КАК ЕстьРеквизиты
	|ИЗ
	|	ПланВидовХарактеристик.ВидыДополнительныхРеквизитов КАК ВидыДополнительныхРеквизитов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ВидыДополнительныхРеквизитов.ИспользоватьВОбъектах КАК Использование
	|		ПО ВидыДополнительныхРеквизитов.Ссылка = Использование.Ссылка
	|ГДЕ
	|	Использование.Тип = &ПустаяСсылкаТипаОбъекта
	|	И Использование.Филиал = ЗНАЧЕНИЕ(Справочник.Филиалы.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА
	|ИЗ
	|	ПланВидовХарактеристик.ВидыДополнительныхРеквизитов КАК ВидыДополнительныхРеквизитов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ВидыДополнительныхРеквизитов.ИспользоватьВОбъектах КАК Использование
	|		ПО ВидыДополнительныхРеквизитов.Ссылка = Использование.Ссылка
	|ГДЕ
	|	Использование.Тип = &ПустаяСсылкаТипаОбъекта
	|	И Использование.Филиал = &ФилиалПользователя";
	
	Запрос.УстановитьПараметр("ПустаяСсылкаТипаОбъекта", Новый(ТипЗнч(Объект)));
	Запрос.УстановитьПараметр("ФилиалПользователя", ПараметрыСеанса.Филиал);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

// Выполняет проверку типа значения характеристики на примитивный тип
//
// Параметры:
//  Владелец - ПланВидовХарактеристикСсылка.ВидыДополнительныхРеквизитов	 - характеристики, тип значения которой требуется проверить
// 
// Возвращаемое значение:
//   - Булево
//
Функция РазрешеноСоздаватьДоступныеЗначения(Знач Владелец) Экспорт

	ТипЗначенияВладельца = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "ТипЗначения");
	
	Возврат (ТипЗначенияВладельца.СодержитТип(Тип("СправочникСсылка.ДоступныеЗначенияРеквизитов")));
	
КонецФункции
	
#КонецОбласти      

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПредопределенныйЭлемент(ИмяЭлемента, ПустаяСсылка) 
	
	Попытка
		Объект = ОбщегоНазначения.ПредопределенныйЭлемент("ПланВидовХарактеристик.ВидыДополнительныхРеквизитов." + ИмяЭлемента);
	Исключение
		Сообщение = НСтр("ru = 'Предопределенный элемент ""%Параметр%"" не найден.'");
		Сообщение = СтрЗаменить(Сообщение, "%Параметр%", "ПланыВидовХарактеристик.ВидыДополнительныхРеквизитов." + ИмяЭлемента);
		ВызватьИсключение Сообщение;
	КонецПопытки;
	
	НужнаЗапись = Ложь;
		
	Если Объект = Неопределено Тогда  
		Сообщение = НСтр("ru = 'Предопределенный элемент ""%Параметр%"" не найден.'");
		Сообщение = СтрЗаменить(Сообщение, "%Параметр%", "ПланыВидовХарактеристик.ВидыДополнительныхРеквизитов." + ИмяЭлемента);
		ВызватьИсключение Сообщение;
	КонецЕсли;
	
	Объект = Объект.ПолучитьОбъект();  
	НайденнаяСтрока = Объект.ИспользоватьВОбъектах.Найти(ПустаяСсылка, "Тип");
	
	Если НайденнаяСтрока = Неопределено Тогда
		НайденнаяСтрока = Объект.ИспользоватьВОбъектах.Добавить();
		НайденнаяСтрока.Тип = ПустаяСсылка;
		НайденнаяСтрока.Описание = ПустаяСсылка.Метаданные().Имя;		
		Объект.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
